//Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше или равна 3 символам.

Console.Clear();
Console.Write("строки через пробел: ");
string? [] input = Console.ReadLine().Split();

//Console.WriteLine(input[1]);